Revit 2027 API
Gradient.GradientNoiseSmooth Property
 The property labeled "Smooth" from the "Gradient" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string GradientNoiseSmooth { get; }
Public Shared ReadOnly Property GradientNoiseSmooth As String
	Get
public:
static property String^ GradientNoiseSmooth {
	String^ get ();
}
static member GradientNoiseSmooth : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyDouble" within the range of "0, 1".
See Also
Reference
Gradient Class
Autodesk.Revit.DB.Visual Namespace